<template>
  <div class="board">
    <div class="board-title">방명록</div>
    <div class="board-list">
        <div class="board-content">
          <div class="board-content-body">
            하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽하이하이룽
          </div>
          <div class="board-content-date">
            <div class="create-date">2022년 8월 1일</div>
            <div class="create-time">11:40</div>
          </div>
        </div>
        <div class="board-content">
          <div class="board-content-body">
            바이바이맨~
          </div>
          <div class="board-content-date">
            <div class="create-date">2022년 8월 1일</div>
            <div class="create-time">11:40</div>
          </div>
        </div>
      <!-- 이 밑으로 추가! -->
    </div>
  </div>
</template>
<script setup>

</script>
<style>
.board {
  display: flex;
  flex-direction: column;
  margin: 12px 32px 0px 32px;
  flex-grow: 1;
}
.board-title {
  display: flex;
  justify-content: center;
  align-items: center;
  padding: 12px;
  background-color: #f5f5f5;
  font-size: 1.2rem;
  border-radius: 10px 10px 0px 0px;
}
.board-list {
  /* flex-grow: 1; */
  /* overflow: scroll; */
  overflow: auto;
  height: 500px;
}
.board-list::-webkit-scrollbar {
  width: 10px;
  background-color: black;
}
</style>